Revit 2026 API

# BuiltInFailuresCopyMonitorFailures Class

---

Failures about CopyWatch.

SystemObject Autodesk.Revit.DBBuiltInFailuresCopyMonitorFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class CopyMonitorFailures
```
```vb
Public NotInheritable Class CopyMonitorFailures
```
```cpp
public ref class CopyMonitorFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type CopyMonitorFailures = class end
```

The BuiltInFailuresCopyMonitorFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlreadyCopiedAndStopWatch | Element has already been copied. Stop existing monitoring to copy again. |
|  | AlreadyWatched | Elements already monitored. |
|  | CannotCopyCuttingInsert | Copy/Monitor does not support cutting inserts in floors. Some openings were not copied. |
|  | CannotMoveHostedFixtureViaCopyMonitor | The fixture is hosted and cannot be moved. Use the Move command to relocate the fixture in the host file as required. |
|  | CopyWatchAlert | Coordination Monitor alert : [Description] |
|  | GridDeletedSameName | Grid cannot be copied because grid with desired name '[Name]' already exist in a target document. |
|  | LevelDeletedSameName | Level cannot be copied because level with desired name '[Name]' already exist in a target document. |

#### Reference

Autodesk.Revit.DB Namespace